$VAR1 = {
          'ABI_DUMPER_VERSION' => '0.99.16',
          'ABI_DUMP_VERSION' => '3.2',
          'Arch' => 'x86_64',
          'GccVersion' => '6.2.1',
          'Headers' => {
                         'libtasn1.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libtasn1.so.6.0.0',
          'LibraryVersion' => undef,
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'ASN1.y' => 1,
                         'coding.c' => 1,
                         'decoding.c' => 1,
                         'element.c' => 1,
                         'errors.c' => 1,
                         'parser_aux.c' => 1,
                         'structure.c' => 1,
                         'version.c' => 1
                       },
          'SymbolInfo' => {
                            '10386' => {
                                         'Header' => 'libtasn1.h',
                                         'Param' => {
                                                      '0' => {
                                                               'name' => 'element',
                                                               'type' => '1174'
                                                             },
                                                      '1' => {

                                                  'asn1_array2tree@@LIBTASN1_0_3' => 1,
                                                  'asn1_bit_der@@LIBTASN1_0_3' => 1,
                                                  'asn1_check_version@@LIBTASN1_0_3' => 1,
                                                  'asn1_copy_node@@LIBTASN1_0_3' => 1,
                                                  'asn1_create_element@@LIBTASN1_0_3' => 1,
                                                  'asn1_delete_element@@LIBTASN1_0_3' => 1,
                                                  'asn1_delete_structure@@LIBTASN1_0_3' => 1,
                                                  'asn1_der_coding@@LIBTASN1_0_3' => 1,
                                                  'asn1_der_decoding@@LIBTASN1_0_3' => 1,
                                                  'asn1_der_decoding_element@@LIBTASN1_0_3' => 1,
                                                  'asn1_der_decoding_startEnd@@LIBTASN1_0_3' => 1,
                                                  'asn1_expand_any_defined_by@@LIBTASN1_0_3' => 1,
                                                  'asn1_expand_octet_string@@LIBTASN1_0_3' => 1,
                                                  'asn1_find_node@@LIBTASN1_0_3' => 1,
                                                  'asn1_find_structure_from_oid@@LIBTASN1_0_3' => 1,
                                                  'asn1_get_bit_der@@LIBTASN1_0_3' => 1,
                                                  'asn1_get_length_ber@@LIBTASN1_0_3' => 1,
                                                  'asn1_get_length_der@@LIBTASN1_0_3' => 1,
                                                  'asn1_get_octet_der@@LIBTASN1_0_3' => 1,
                                                  'asn1_get_tag_der@@LIBTASN1_0_3' => 1,
                                                  'asn1_length_der@@LIBTASN1_0_3' => 1,
                                                  'asn1_number_of_elements@@LIBTASN1_0_3' => 1,
                                                  'asn1_octet_der@@LIBTASN1_0_3' => 1,
                                                  'asn1_parser2array@@LIBTASN1_0_3' => 1,
                                                  'asn1_parser2tree@@LIBTASN1_0_3' => 1,
                                                  'asn1_perror@@LIBTASN1_0_3' => 1,
                                                  'asn1_print_structure@@LIBTASN1_0_3' => 1,
                                                  'asn1_read_node_value@@LIBTASN1_0_3' => 1,
                                                  'asn1_read_tag@@LIBTASN1_0_3' => 1,
                                                  'asn1_read_value@@LIBTASN1_0_3' => 1,
                                                  'asn1_strerror@@LIBTASN1_0_3' => 1,
                                                  'asn1_write_value@@LIBTASN1_0_3' => 1
                                                }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '1042' => {
                                      'BaseType' => '1053',
                                      'Header' => 'libtasn1.h',
                                      'Line' => '109',
                                      'Name' => 'asn1_node_st',
                                      'Size' => '136',
                                      'Type' => 'Typedef'
                                    },
                          '1053' => {
                                      'Header' => 'int.h',
                                      'Line' => '46',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '1191'
                                                         },
                                                  '1' => {
                                                           'name' => 'name_hash',
                                                           'offset' => '68',
                                                           'type' => '152'
                                                         },
                                                  '2' => {
                                                           'name' => 'type',
                                                           'offset' => '72',
                                                           'type' => '152'
                                                         },
                                                  '3' => {
                                                           'name' => 'value',
                                                           'offset' => '80',
                                                           'type' => '1207'
                                                         },
                                                  '4' => {
                                                           'name' => 'value_len',
                                                           'offset' => '88',
                                                           'type' => '84'
                                                         },
                                                  '5' => {
                                                           'name' => 'down',
                                                           'offset' => '96',
                                                           'type' => '1174'
                                                         },
                                                  '6' => {
                                                           'name' => 'right',
                                                           'offset' => '104',
                                                           'type' => '1174'
                                                         },
                                                  '7' => {
                                                           'name' => 'left',
                                                           'offset' => '112',
                                                           'type' => '1174'
                                                         },
                                                  '8' => {
                                                           'name' => 'small_value',
                                                           'offset' => '120',
                                                           'type' => '1213'
                                                         }
                                                },
                                      'Name' => 'struct asn1_node_st',
                                      'PrivateABI' => 1,
                                      'Size' => '136',
                                      'Type' => 'Struct'
                                    },
                          '107' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '114' => {
                                     'BaseType' => '107',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '1174' => {
                                      'BaseType' => '1185',
                                      'Header' => 'libtasn1.h',
                                      'Line' => '111',
                                      'Name' => 'asn1_node',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1185' => {
                                      'BaseType' => '1042',
                                      'Name' => 'asn1_node_st*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '119' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '1191' => {
                                      'BaseType' => '107',
                                      'Name' => 'char[65]',
                                      'Size' => '65',
                                      'Type' => 'Array'
                                    },
                          '1207' => {
                                      'BaseType' => '159',
                                      'Name' => 'unsigned char*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1213' => {
                                      'BaseType' => '159',
                                      'Name' => 'unsigned char[16]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '1250' => {
                                      'BaseType' => '217',
                                      'Name' => 'FILE*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '152' => {
                                     'Name' => 'unsigned int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '15262' => {
                                       'BaseType' => '84',
                                       'Name' => 'int*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '159' => {
                                     'Name' => 'unsigned char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '16332' => {
                                       'BaseType' => '9379',
                                       'Name' => 'unsigned char const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '166' => {
                                     'Name' => 'signed char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '17790' => {
                                       'BaseType' => '17796',
                                       'Name' => 'void const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17796' => {
                                       'BaseType' => '1',
                                       'Name' => 'void const',
                                       'Type' => 'Const'
                                     },
                          '180' => {
                                     'BaseType' => '119',
                                     'Header' => 'types.h',
                                     'Line' => '131',
                                     'Name' => '__off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '191' => {
                                     'BaseType' => '119',
                                     'Header' => 'types.h',
                                     'Line' => '132',
                                     'Name' => '__off64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '202' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '204' => {
                                     'BaseType' => '107',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '217' => {
                                     'BaseType' => '228',
                                     'Header' => 'stdio.h',
                                     'Line' => '48',
                                     'Name' => 'FILE',
                                     'Size' => '216',
                                     'Type' => 'Typedef'
                                   },
                          '228' => {
                                     'Header' => 'libio.h',
                                     'Line' => '241',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => '_flags',
                                                          'offset' => '0',
                                                          'type' => '84'
                                                        },
                                                 '1' => {
                                                          'name' => '_IO_read_ptr',
                                                          'offset' => '8',
                                                          'type' => '204'
                                                        },
                                                 '10' => {
                                                           'name' => '_IO_backup_base',
                                                           'offset' => '80',
                                                           'type' => '204'
                                                         },
                                                 '11' => {
                                                           'name' => '_IO_save_end',
                                                           'offset' => '88',
                                                           'type' => '204'
                                                         },
                                                 '12' => {
                                                           'name' => '_markers',
                                                           'offset' => '96',
                                                           'type' => '665'
                                                         },
                                                 '13' => {
                                                           'name' => '_chain',
                                                           'offset' => '104',
                                                           'type' => '671'
                                                         },
                                                 '14' => {
                                                           'name' => '_fileno',
                                                           'offset' => '112',
                                                           'type' => '84'
                                                         },
                                                 '15' => {
                                                           'name' => '_flags2',
                                                           'offset' => '116',
                                                           'type' => '84'
                                                         },
                                                 '16' => {
                                                           'name' => '_old_offset',
                                                           'offset' => '120',
                                                           'type' => '180'
                                                         },
                                                 '17' => {
                                                           'name' => '_cur_column',
                                                           'offset' => '128',
                                                           'type' => '77'
                                                         },
                                                 '18' => {
                                                           'name' => '_vtable_offset',
                                                           'offset' => '130',
                                                           'type' => '166'
                                                         },
                                                 '19' => {
                                                           'name' => '_shortbuf',
                                                           'offset' => '131',
                                                           'type' => '677'
                                                         },
                                                 '2' => {
                                                          'name' => '_IO_read_end',
                                                          'offset' => '16',
                                                          'type' => '204'
                                                        },
                                                 '20' => {
                                                           'name' => '_lock',
                                                           'offset' => '136',
                                                           'type' => '693'
                                                         },
                                                 '21' => {
                                                           'name' => '_offset',
                                                           'offset' => '144',
                                                           'type' => '191'
                                                         },
                                                 '22' => {
                                                           'name' => '__pad1',
                                                           'offset' => '152',
                                                           'type' => '202'
                                                         },
                                                 '23' => {
                                                           'name' => '__pad2',
                                                           'offset' => '160',
                                                           'type' => '202'
                                                         },
                                                 '24' => {
                                                           'name' => '__pad3',
                                                           'offset' => '168',
                                                           'type' => '202'
                                                         },
                                                 '25' => {
                                                           'name' => '__pad4',
                                                           'offset' => '176',
                                                           'type' => '202'
                                                         },
                                                 '26' => {
                                                           'name' => '__pad5',
                                                           'offset' => '184',
                                                           'type' => '59'
                                                         },
                                                 '27' => {
                                                           'name' => '_mode',
                                                           'offset' => '192',
                                                           'type' => '84'
                                                         },
                                                 '28' => {
                                                           'name' => '_unused2',
                                                           'offset' => '196',
                                                           'type' => '699'
                                                         },
                                                 '3' => {
                                                          'name' => '_IO_read_base',
                                                          'offset' => '24',
                                                          'type' => '204'
                                                        },
                                                 '4' => {
                                                          'name' => '_IO_write_base',
                                                          'offset' => '32',
                                                          'type' => '204'
                                                        },
                                                 '5' => {
                                                          'name' => '_IO_write_ptr',
                                                          'offset' => '40',
                                                          'type' => '204'
                                                        },
                                                 '6' => {
                                                          'name' => '_IO_write_end',
                                                          'offset' => '48',
                                                          'type' => '204'
                                                        },
                                                 '7' => {
                                                          'name' => '_IO_buf_base',
                                                          'offset' => '56',
                                                          'type' => '204'
                                                        },
                                                 '8' => {
                                                          'name' => '_IO_buf_end',
                                                          'offset' => '64',
                                                          'type' => '204'
                                                        },
                                                 '9' => {
                                                          'name' => '_IO_save_base',
                                                          'offset' => '72',
                                                          'type' => '204'
                                                        }
                                               },
                                     'Name' => 'struct _IO_FILE',
                                     'PrivateABI' => 1,
                                     'Size' => '216',
                                     'Type' => 'Struct'
                                   },
                          '30312' => {
                                       'BaseType' => '45',
                                       'Name' => 'unsigned long*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '3048' => {
                                      'BaseType' => '1174',
                                      'Name' => 'asn1_node*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '33322' => {
                                       'Header' => 'libtasn1.h',
                                       'Line' => '153',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '96'
                                                          },
                                                   '1' => {
                                                            'name' => 'value',
                                                            'offset' => '8',
                                                            'type' => '17790'
                                                          },
                                                   '2' => {
                                                            'name' => 'value_len',
                                                            'offset' => '16',
                                                            'type' => '152'
                                                          },
                                                   '3' => {
                                                            'name' => 'type',
                                                            'offset' => '20',
                                                            'type' => '152'
                                                          }
                                                 },
                                       'Name' => 'struct asn1_data_node_st',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '33383' => {
                                       'BaseType' => '33322',
                                       'Header' => 'libtasn1.h',
                                       'Line' => '160',
                                       'Name' => 'asn1_data_node_st',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '33495' => {
                                       'BaseType' => '33383',
                                       'Name' => 'asn1_data_node_st*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '45' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '47499' => {
                                       'Header' => 'libtasn1.h',
                                       'Line' => '121',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '96'
                                                          },
                                                   '1' => {
                                                            'name' => 'type',
                                                            'offset' => '8',
                                                            'type' => '152'
                                                          },
                                                   '2' => {
                                                            'name' => 'value',
                                                            'offset' => '16',
                                                            'type' => '17790'
                                                          }
                                                 },
                                       'Name' => 'struct asn1_static_node_st',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '47548' => {
                                       'BaseType' => '47499',
                                       'Header' => 'libtasn1.h',
                                       'Line' => '127',
                                       'Name' => 'asn1_static_node_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '47559' => {
                                       'BaseType' => '47548',
                                       'Name' => 'asn1_static_node_t const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '55124' => {
                                       'BaseType' => '47559',
                                       'Name' => 'asn1_static_node_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '59' => {
                                    'BaseType' => '45',
                                    'Header' => 'stddef.h',
                                    'Line' => '216',
                                    'Name' => 'size_t',
                                    'Size' => '8',
                                    'Type' => 'Typedef'
                                  },
                          '609' => {
                                     'Header' => 'libio.h',
                                     'Line' => '150',
                                     'Name' => '_IO_lock_t',
                                     'Type' => 'Typedef'
                                   },
                          '616' => {
                                     'Header' => 'libio.h',
                                     'Line' => '156',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => '_next',
                                                          'offset' => '0',
                                                          'type' => '665'
                                                        },
                                                 '1' => {
                                                          'name' => '_sbuf',
                                                          'offset' => '8',
                                                          'type' => '671'
                                                        },
                                                 '2' => {
                                                          'name' => '_pos',
                                                          'offset' => '16',
                                                          'type' => '84'
                                                        }
                                               },
                                     'Name' => 'struct _IO_marker',
                                     'PrivateABI' => 1,
                                     'Size' => '24',
                                     'Type' => 'Struct'
                                   },
                          '665' => {
                                     'BaseType' => '616',
                                     'Name' => 'struct _IO_marker*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '671' => {
                                     'BaseType' => '228',
                                     'Name' => 'struct _IO_FILE*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '677' => {
                                     'BaseType' => '107',
                                     'Name' => 'char[1]',
                                     'Size' => '1',
                                     'Type' => 'Array'
                                   },
                          '693' => {
                                     'BaseType' => '609',
                                     'Name' => '_IO_lock_t*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '699' => {
                                     'BaseType' => '107',
                                     'Name' => 'char[20]',
                                     'Size' => '20',
                                     'Type' => 'Array'
                                   },
                          '77' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '84' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '9379' => {
                                      'BaseType' => '159',
                                      'Name' => 'unsigned char const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '96' => {
                                    'BaseType' => '114',
                                    'Name' => 'char const*',
                                    'Size' => '8',
                                    'Type' => 'Pointer'
                                  }
                        },
          'UndefinedSymbols' => {
                                  'libtasn1.so.6.0.0' => {
                                                           '_ITM_deregisterTMCloneTable' => 0,
                                                           '_ITM_registerTMCloneTable' => 0,
                                                           '_Jv_RegisterClasses' => 0,
                                                           '__ctype_b_loc@GLIBC_2.3' => 0,
                                                           '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                           '__gmon_start__' => 0,
                                                           'calloc@GLIBC_2.2.5' => 0,
                                                           'fclose@GLIBC_2.2.5' => 0,
                                                           'fgetc@GLIBC_2.2.5' => 0,
                                                           'fopen@GLIBC_2.2.5' => 0,
                                                           'fprintf@GLIBC_2.2.5' => 0,
                                                           'fputc@GLIBC_2.2.5' => 0,
                                                           'free@GLIBC_2.2.5' => 0,
                                                           'fwrite@GLIBC_2.2.5' => 0,
                                                           'malloc@GLIBC_2.2.5' => 0,
                                                           'memcmp@GLIBC_2.2.5' => 0,
                                                           'memcpy@GLIBC_2.14' => 0,
                                                           'memmove@GLIBC_2.2.5' => 0,
                                                           'realloc@GLIBC_2.2.5' => 0,
                                                           'snprintf@GLIBC_2.2.5' => 0,
                                                           'stderr@GLIBC_2.2.5' => 0,
                                                           'stpcpy@GLIBC_2.2.5' => 0,
                                                           'strchr@GLIBC_2.2.5' => 0,
                                                           'strcmp@GLIBC_2.2.5' => 0,
                                                           'strcpy@GLIBC_2.2.5' => 0,
                                                           'strlen@GLIBC_2.2.5' => 0,
                                                           'strncat@GLIBC_2.2.5' => 0,
                                                           'strtol@GLIBC_2.2.5' => 0,
                                                           'strtoul@GLIBC_2.2.5' => 0,
                                                           'strverscmp@GLIBC_2.2.5' => 0,
                                                           'ungetc@GLIBC_2.2.5' => 0
                                                         }
                                },
          'WordSize' => '8'
        };
