$VAR1 = {
          'ABI_DUMPER_VERSION' => '0.99.15',
          'ABI_DUMP_VERSION' => '3.2',
          'Arch' => 'x86_64',
          'GccVersion' => '5.3.1',
          'Headers' => {
                         'int.h' => 1,
                         'libio.h' => 1,
                         'libtasn1.h' => 1,
                         'stddef.h' => 1,
                         'stdio.h' => 1,
                         'types.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libtasn1.so.6.2.4',
          'LibraryVersion' => '3.9',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1
                      },
          'Sources' => {
                         'ASN1.y' => 1,
                         'coding.c' => 1,
                         'decoding.c' => 1,
                         'element.c' => 1,
                         'errors.c' => 1,
                         'parser_aux.c' => 1,
                         'structure.c' => 1,
                         'version.c' => 1
                       },
          'SymbolInfo' => {
                            '10004' => {
                                         'Line' => '897',
                                         'Param' => {
                                                      '0' => {
                                                               'name' => 'element',
                                                               'offset' => '-264',

                                                  'asn1_create_element@@LIBTASN1_0_3' => 1,
                                                  'asn1_decode_simple_der@@LIBTASN1_0_3' => 1,
                                                  'asn1_delete_element@@LIBTASN1_0_3' => 1,
                                                  'asn1_delete_structure2@@LIBTASN1_0_3' => 1,
                                                  'asn1_delete_structure@@LIBTASN1_0_3' => 1,
                                                  'asn1_der_coding@@LIBTASN1_0_3' => 1,
                                                  'asn1_der_decoding@@LIBTASN1_0_3' => 1,
                                                  'asn1_der_decoding_element@@LIBTASN1_0_3' => 1,
                                                  'asn1_der_decoding_startEnd@@LIBTASN1_0_3' => 1,
                                                  'asn1_encode_simple_der@@LIBTASN1_0_3' => 1,
                                                  'asn1_expand_any_defined_by@@LIBTASN1_0_3' => 1,
                                                  'asn1_expand_octet_string@@LIBTASN1_0_3' => 1,
                                                  'asn1_find_node@@LIBTASN1_0_3' => 1,
                                                  'asn1_find_structure_from_oid@@LIBTASN1_0_3' => 1,
                                                  'asn1_get_bit_der@@LIBTASN1_0_3' => 1,
                                                  'asn1_get_length_ber@@LIBTASN1_0_3' => 1,
                                                  'asn1_get_length_der@@LIBTASN1_0_3' => 1,
                                                  'asn1_get_octet_der@@LIBTASN1_0_3' => 1,
                                                  'asn1_get_tag_der@@LIBTASN1_0_3' => 1,
                                                  'asn1_length_der@@LIBTASN1_0_3' => 1,
                                                  'asn1_number_of_elements@@LIBTASN1_0_3' => 1,
                                                  'asn1_octet_der@@LIBTASN1_0_3' => 1,
                                                  'asn1_parser2array@@LIBTASN1_0_3' => 1,
                                                  'asn1_parser2tree@@LIBTASN1_0_3' => 1,
                                                  'asn1_perror@@LIBTASN1_0_3' => 1,
                                                  'asn1_print_structure@@LIBTASN1_0_3' => 1,
                                                  'asn1_read_node_value@@LIBTASN1_0_3' => 1,
                                                  'asn1_read_tag@@LIBTASN1_0_3' => 1,
                                                  'asn1_read_value@@LIBTASN1_0_3' => 1,
                                                  'asn1_read_value_type@@LIBTASN1_0_3' => 1,
                                                  'asn1_strerror@@LIBTASN1_0_3' => 1,
                                                  'asn1_write_value@@LIBTASN1_0_3' => 1
                                                }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '102' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '12085' => {
                                       'BaseType' => '4826',
                                       'Name' => 'unsigned char const**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '123' => {
                                     'Name' => 'unsigned char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '12557' => {
                                       'Header' => 'libtasn1.h',
                                       'Line' => '188',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '84'
                                                          },
                                                   '1' => {
                                                            'name' => 'value',
                                                            'offset' => '8',
                                                            'type' => '7365'
                                                          },
                                                   '2' => {
                                                            'name' => 'value_len',
                                                            'offset' => '16',
                                                            'type' => '130'
                                                          },
                                                   '3' => {
                                                            'name' => 'type',
                                                            'offset' => '20',
                                                            'type' => '130'
                                                          }
                                                 },
                                       'Name' => 'struct asn1_data_node_st',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '12618' => {
                                       'BaseType' => '12557',
                                       'Header' => 'libtasn1.h',
                                       'Line' => '195',
                                       'Name' => 'asn1_data_node_st',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '130' => {
                                     'Name' => 'unsigned int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '137' => {
                                     'Name' => 'signed char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '14078' => {
                                       'BaseType' => '12618',
                                       'Name' => 'asn1_data_node_st*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '151' => {
                                     'BaseType' => '102',
                                     'Header' => 'types.h',
                                     'Line' => '131',
                                     'Name' => '__off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '162' => {
                                     'BaseType' => '102',
                                     'Header' => 'types.h',
                                     'Line' => '132',
                                     'Name' => '__off64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '173' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '175' => {
                                     'BaseType' => '90',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '1853' => {
                                      'BaseType' => '56',
                                      'Name' => 'unsigned long*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '188' => {
                                     'BaseType' => '199',
                                     'Header' => 'stdio.h',
                                     'Line' => '48',
                                     'Name' => 'FILE',
                                     'Size' => '216',
                                     'Type' => 'Typedef'
                                   },
                          '18912' => {
                                       'Header' => 'libtasn1.h',
                                       'Line' => '140',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '84'
                                                          },
                                                   '1' => {
                                                            'name' => 'type',
                                                            'offset' => '8',
                                                            'type' => '130'
                                                          },
                                                   '2' => {
                                                            'name' => 'value',
                                                            'offset' => '16',
                                                            'type' => '7365'
                                                          }
                                                 },
                                       'Name' => 'struct asn1_static_node_st',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '18961' => {
                                       'BaseType' => '18912',
                                       'Header' => 'libtasn1.h',
                                       'Line' => '146',
                                       'Name' => 'asn1_static_node',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '19632' => {
                                       'BaseType' => '19638',
                                       'Name' => 'asn1_static_node const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19638' => {
                                       'BaseType' => '18961',
                                       'Name' => 'asn1_static_node const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '199' => {
                                     'Header' => 'libio.h',
                                     'Line' => '245',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => '_flags',
                                                          'offset' => '0',
                                                          'type' => '77'
                                                        },
                                                 '1' => {
                                                          'name' => '_IO_read_ptr',
                                                          'offset' => '8',
                                                          'type' => '175'
                                                        },
                                                 '10' => {
                                                           'name' => '_IO_backup_base',
                                                           'offset' => '80',
                                                           'type' => '175'
                                                         },
                                                 '11' => {
                                                           'name' => '_IO_save_end',
                                                           'offset' => '88',
                                                           'type' => '175'
                                                         },
                                                 '12' => {
                                                           'name' => '_markers',
                                                           'offset' => '96',
                                                           'type' => '639'
                                                         },
                                                 '13' => {
                                                           'name' => '_chain',
                                                           'offset' => '104',
                                                           'type' => '645'
                                                         },
                                                 '14' => {
                                                           'name' => '_fileno',
                                                           'offset' => '112',
                                                           'type' => '77'
                                                         },
                                                 '15' => {
                                                           'name' => '_flags2',
                                                           'offset' => '116',
                                                           'type' => '77'
                                                         },
                                                 '16' => {
                                                           'name' => '_old_offset',
                                                           'offset' => '120',
                                                           'type' => '151'
                                                         },
                                                 '17' => {
                                                           'name' => '_cur_column',
                                                           'offset' => '128',
                                                           'type' => '70'
                                                         },
                                                 '18' => {
                                                           'name' => '_vtable_offset',
                                                           'offset' => '130',
                                                           'type' => '137'
                                                         },
                                                 '19' => {
                                                           'name' => '_shortbuf',
                                                           'offset' => '131',
                                                           'type' => '651'
                                                         },
                                                 '2' => {
                                                          'name' => '_IO_read_end',
                                                          'offset' => '16',
                                                          'type' => '175'
                                                        },
                                                 '20' => {
                                                           'name' => '_lock',
                                                           'offset' => '136',
                                                           'type' => '667'
                                                         },
                                                 '21' => {
                                                           'name' => '_offset',
                                                           'offset' => '144',
                                                           'type' => '162'
                                                         },
                                                 '22' => {
                                                           'name' => '__pad1',
                                                           'offset' => '152',
                                                           'type' => '173'
                                                         },
                                                 '23' => {
                                                           'name' => '__pad2',
                                                           'offset' => '160',
                                                           'type' => '173'
                                                         },
                                                 '24' => {
                                                           'name' => '__pad3',
                                                           'offset' => '168',
                                                           'type' => '173'
                                                         },
                                                 '25' => {
                                                           'name' => '__pad4',
                                                           'offset' => '176',
                                                           'type' => '173'
                                                         },
                                                 '26' => {
                                                           'name' => '__pad5',
                                                           'offset' => '184',
                                                           'type' => '45'
                                                         },
                                                 '27' => {
                                                           'name' => '_mode',
                                                           'offset' => '192',
                                                           'type' => '77'
                                                         },
                                                 '28' => {
                                                           'name' => '_unused2',
                                                           'offset' => '196',
                                                           'type' => '673'
                                                         },
                                                 '3' => {
                                                          'name' => '_IO_read_base',
                                                          'offset' => '24',
                                                          'type' => '175'
                                                        },
                                                 '4' => {
                                                          'name' => '_IO_write_base',
                                                          'offset' => '32',
                                                          'type' => '175'
                                                        },
                                                 '5' => {
                                                          'name' => '_IO_write_ptr',
                                                          'offset' => '40',
                                                          'type' => '175'
                                                        },
                                                 '6' => {
                                                          'name' => '_IO_write_end',
                                                          'offset' => '48',
                                                          'type' => '175'
                                                        },
                                                 '7' => {
                                                          'name' => '_IO_buf_base',
                                                          'offset' => '56',
                                                          'type' => '175'
                                                        },
                                                 '8' => {
                                                          'name' => '_IO_buf_end',
                                                          'offset' => '64',
                                                          'type' => '175'
                                                        },
                                                 '9' => {
                                                          'name' => '_IO_save_base',
                                                          'offset' => '72',
                                                          'type' => '175'
                                                        }
                                               },
                                     'Name' => 'struct _IO_FILE',
                                     'Size' => '216',
                                     'Type' => 'Struct'
                                   },
                          '2949' => {
                                      'BaseType' => '914',
                                      'Name' => 'asn1_node*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3194' => {
                                      'BaseType' => '188',
                                      'Name' => 'FILE*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4118' => {
                                      'BaseType' => '77',
                                      'Name' => 'int*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4318' => {
                                      'Header' => 'int.h',
                                      'Line' => '61',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'tag',
                                                           'offset' => '0',
                                                           'type' => '130'
                                                         },
                                                  '1' => {
                                                           'name' => 'class',
                                                           'offset' => '4',
                                                           'type' => '130'
                                                         },
                                                  '2' => {
                                                           'name' => 'desc',
                                                           'offset' => '8',
                                                           'type' => '84'
                                                         }
                                                },
                                      'Name' => 'struct tag_and_class_st',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '4367' => {
                                      'BaseType' => '4318',
                                      'Header' => 'int.h',
                                      'Line' => '66',
                                      'Name' => 'tag_and_class_st',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '45' => {
                                    'BaseType' => '56',
                                    'Header' => 'stddef.h',
                                    'Line' => '216',
                                    'Name' => 'size_t',
                                    'Size' => '8',
                                    'Type' => 'Typedef'
                                  },
                          '4826' => {
                                      'BaseType' => '4832',
                                      'Name' => 'unsigned char const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4832' => {
                                      'BaseType' => '123',
                                      'Name' => 'unsigned char const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '5027' => {
                                      'BaseType' => '130',
                                      'Name' => 'unsigned int*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '56' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '583' => {
                                     'Header' => 'libio.h',
                                     'Line' => '154',
                                     'Name' => '_IO_lock_t',
                                     'Type' => 'Typedef'
                                   },
                          '590' => {
                                     'Header' => 'libio.h',
                                     'Line' => '160',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => '_next',
                                                          'offset' => '0',
                                                          'type' => '639'
                                                        },
                                                 '1' => {
                                                          'name' => '_sbuf',
                                                          'offset' => '8',
                                                          'type' => '645'
                                                        },
                                                 '2' => {
                                                          'name' => '_pos',
                                                          'offset' => '16',
                                                          'type' => '77'
                                                        }
                                               },
                                     'Name' => 'struct _IO_marker',
                                     'Size' => '24',
                                     'Type' => 'Struct'
                                   },
                          '639' => {
                                     'BaseType' => '590',
                                     'Name' => 'struct _IO_marker*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '645' => {
                                     'BaseType' => '199',
                                     'Name' => 'struct _IO_FILE*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '651' => {
                                     'BaseType' => '90',
                                     'Name' => 'char[1]',
                                     'Size' => '1',
                                     'Type' => 'Array'
                                   },
                          '667' => {
                                     'BaseType' => '583',
                                     'Name' => '_IO_lock_t*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '673' => {
                                     'BaseType' => '90',
                                     'Name' => 'char[20]',
                                     'Size' => '20',
                                     'Type' => 'Array'
                                   },
                          '70' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '7162' => {
                                      'BaseType' => '4367',
                                      'Name' => 'tag_and_class_st[38]',
                                      'Size' => '608',
                                      'Type' => 'Array'
                                    },
                          '7200' => {
                                      'BaseType' => '7162',
                                      'Name' => 'tag_and_class_st[38] const',
                                      'Size' => '608',
                                      'Type' => 'Const'
                                    },
                          '7365' => {
                                      'BaseType' => '7371',
                                      'Name' => 'void const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7371' => {
                                      'BaseType' => '1',
                                      'Name' => 'void const',
                                      'Type' => 'Const'
                                    },
                          '77' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '782' => {
                                     'BaseType' => '793',
                                     'Header' => 'libtasn1.h',
                                     'Line' => '128',
                                     'Name' => 'asn1_node_st',
                                     'Size' => '136',
                                     'Type' => 'Typedef'
                                   },
                          '793' => {
                                     'Header' => 'int.h',
                                     'Line' => '46',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'name',
                                                          'offset' => '0',
                                                          'type' => '931'
                                                        },
                                                 '1' => {
                                                          'name' => 'name_hash',
                                                          'offset' => '68',
                                                          'type' => '130'
                                                        },
                                                 '2' => {
                                                          'name' => 'type',
                                                          'offset' => '72',
                                                          'type' => '130'
                                                        },
                                                 '3' => {
                                                          'name' => 'value',
                                                          'offset' => '80',
                                                          'type' => '947'
                                                        },
                                                 '4' => {
                                                          'name' => 'value_len',
                                                          'offset' => '88',
                                                          'type' => '77'
                                                        },
                                                 '5' => {
                                                          'name' => 'down',
                                                          'offset' => '96',
                                                          'type' => '914'
                                                        },
                                                 '6' => {
                                                          'name' => 'right',
                                                          'offset' => '104',
                                                          'type' => '914'
                                                        },
                                                 '7' => {
                                                          'name' => 'left',
                                                          'offset' => '112',
                                                          'type' => '914'
                                                        },
                                                 '8' => {
                                                          'name' => 'small_value',
                                                          'offset' => '120',
                                                          'type' => '953'
                                                        }
                                               },
                                     'Name' => 'struct asn1_node_st',
                                     'Size' => '136',
                                     'Type' => 'Struct'
                                   },
                          '84' => {
                                    'BaseType' => '97',
                                    'Name' => 'char const*',
                                    'Size' => '8',
                                    'Type' => 'Pointer'
                                  },
                          '90' => {
                                    'Name' => 'char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '914' => {
                                     'BaseType' => '925',
                                     'Header' => 'libtasn1.h',
                                     'Line' => '130',
                                     'Name' => 'asn1_node',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '925' => {
                                     'BaseType' => '782',
                                     'Name' => 'asn1_node_st*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '931' => {
                                     'BaseType' => '90',
                                     'Name' => 'char[65]',
                                     'Size' => '65',
                                     'Type' => 'Array'
                                   },
                          '947' => {
                                     'BaseType' => '123',
                                     'Name' => 'unsigned char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '953' => {
                                     'BaseType' => '123',
                                     'Name' => 'unsigned char[16]',
                                     'Size' => '16',
                                     'Type' => 'Array'
                                   },
                          '97' => {
                                    'BaseType' => '90',
                                    'Name' => 'char const',
                                    'Size' => '1',
                                    'Type' => 'Const'
                                  }
                        },
          'UndefinedSymbols' => {
                                  'libtasn1.so.6.2.4' => {
                                                           '_ITM_deregisterTMCloneTable' => 0,
                                                           '_ITM_registerTMCloneTable' => 0,
                                                           '_Jv_RegisterClasses' => 0,
                                                           '__ctype_b_loc@GLIBC_2.3' => 0,
                                                           '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                           '__gmon_start__' => 0,
                                                           'calloc@GLIBC_2.2.5' => 0,
                                                           'fclose@GLIBC_2.2.5' => 0,
                                                           'fgetc@GLIBC_2.2.5' => 0,
                                                           'fopen@GLIBC_2.2.5' => 0,
                                                           'fprintf@GLIBC_2.2.5' => 0,
                                                           'fputc@GLIBC_2.2.5' => 0,
                                                           'fputs@GLIBC_2.2.5' => 0,
                                                           'free@GLIBC_2.2.5' => 0,
                                                           'fwrite@GLIBC_2.2.5' => 0,
                                                           'malloc@GLIBC_2.2.5' => 0,
                                                           'memcmp@GLIBC_2.2.5' => 0,
                                                           'memcpy@GLIBC_2.14' => 0,
                                                           'memmove@GLIBC_2.2.5' => 0,
                                                           'memset@GLIBC_2.2.5' => 0,
                                                           'realloc@GLIBC_2.2.5' => 0,
                                                           'snprintf@GLIBC_2.2.5' => 0,
                                                           'stderr@GLIBC_2.2.5' => 0,
                                                           'stpcpy@GLIBC_2.2.5' => 0,
                                                           'strcat@GLIBC_2.2.5' => 0,
                                                           'strchr@GLIBC_2.2.5' => 0,
                                                           'strcmp@GLIBC_2.2.5' => 0,
                                                           'strcpy@GLIBC_2.2.5' => 0,
                                                           'strlen@GLIBC_2.2.5' => 0,
                                                           'strncat@GLIBC_2.2.5' => 0,
                                                           'strtol@GLIBC_2.2.5' => 0,
                                                           'strtoul@GLIBC_2.2.5' => 0,
                                                           'strverscmp@GLIBC_2.2.5' => 0,
                                                           'ungetc@GLIBC_2.2.5' => 0
                                                         }
                                },
          'WordSize' => '8'
        };
